tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool for exploring each layer in a docker image
brew "dive"
# Modern replacement for 'ls'
brew "exa"
# Efficient Duplicate File Finder
brew "fclones"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Rust toolchain installer
brew "rustup-init"
# 🚀 The Universal WebAssembly Runtime
brew "wasmer"
# Internet file retriever
brew "wget"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "google-chrome-canary"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GUI for streamlined Redis application development
cask "redisinsight"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Git client focusing on power and productivity
cask "tower"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "Keynote", id: 409183694
mas "MaCinema", id: 1180545184
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
