tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool for exploring each layer in a docker image
brew "dive"
# Modern, maintained replacement for ls
brew "eza"
# Efficient Duplicate File Finder
brew "fclones"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Rust toolchain installer
brew "rustup-init"
# Terminal multiplexer
brew "tmux"
# Universal WebAssembly Runtime
brew "wasmer"
# Internet file retriever
brew "wget"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# Records audio from any application
cask "audio-hijack"
# Write, edit, and chat about your code with AI
cask "cursor"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "google-chrome-canary"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Web browser
cask "microsoft-edge"
# Online collaborative whiteboard platform
cask "miro"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GUI for streamlined Redis application development
cask "redisinsight"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Git client focusing on power and productivity
cask "tower"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "Agenda", id: 1287445660
mas "Keynote", id: 409183694
mas "MaCinema", id: 1180545184
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EcksDy.env-switcher"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "googlecloudtools.cloudcode"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "mikestead.dotenv"
vscode "moalamri.inline-fold"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "RapidAPI.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "tldraw-org.tldraw-vscode"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "xirider.livecode"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
